#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`
#### Checkov 🧪`failure`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_app_service.app_service will be created
  + resource "azurerm_app_service" "app_service" {
      + app_service_plan_id               = (known after apply)
      + app_settings                      = (known after apply)
      + client_affinity_enabled           = false
      + client_cert_enabled               = false
      + client_cert_mode                  = (known after apply)
      + custom_domain_verification_id     = (known after apply)
      + default_site_hostname             = (known after apply)
      + enabled                           = true
      + https_only                        = true
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + location                          = "eastus"
      + name                              = (known after apply)
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = (known after apply)
      + site_credential                   = (known after apply)

      + auth_settings {
          + additional_login_params        = (known after apply)
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = (known after apply)
          + enabled                        = (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = (known after apply)
          + token_store_enabled            = (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + logs {
          + detailed_error_messages_enabled = (known after apply)
          + failed_request_tracing_enabled  = (known after apply)

          + application_logs {
              + file_system_level = (known after apply)

              + azure_blob_storage {
                  + level             = (known after apply)
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }
            }

          + http_logs {
              + azure_blob_storage {
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }

              + file_system {
                  + retention_in_days = (known after apply)
                  + retention_in_mb   = (known after apply)
                }
            }
        }

      + site_config {
          + acr_use_managed_identity_credentials = (known after apply)
          + acr_user_managed_identity_client_id  = (known after apply)
          + always_on                            = (known after apply)
          + app_command_line                     = (known after apply)
          + auto_swap_slot_name                  = (known after apply)
          + default_documents                    = (known after apply)
          + dotnet_framework_version             = (known after apply)
          + ftps_state                           = (known after apply)
          + health_check_path                    = (known after apply)
          + http2_enabled                        = (known after apply)
          + ip_restriction                       = (known after apply)
          + java_container                       = (known after apply)
          + java_container_version               = (known after apply)
          + java_version                         = (known after apply)
          + linux_fx_version                     = (known after apply)
          + local_mysql_enabled                  = (known after apply)
          + managed_pipeline_mode                = (known after apply)
          + min_tls_version                      = (known after apply)
          + number_of_workers                    = (known after apply)
          + php_version                          = (known after apply)
          + python_version                       = (known after apply)
          + remote_debugging_enabled             = (known after apply)
          + remote_debugging_version             = (known after apply)
          + scm_ip_restriction                   = (known after apply)
          + scm_type                             = (known after apply)
          + scm_use_main_ip_restriction          = (known after apply)
          + use_32_bit_worker_process            = (known after apply)
          + vnet_route_all_enabled               = (known after apply)
          + websockets_enabled                   = (known after apply)
          + windows_fx_version                   = (known after apply)

          + cors {
              + allowed_origins     = (known after apply)
              + support_credentials = (known after apply)
            }
        }

      + source_control {
          + branch             = "main"
          + manual_integration = true
          + repo_url           = "https://github.com/ned1313/nodejs-docs-hello-world"
          + rollback_enabled   = (known after apply)
          + use_mercurial      = false
        }

      + storage_account {
          + access_key   = (sensitive value)
          + account_name = (known after apply)
          + mount_path   = (known after apply)
          + name         = (known after apply)
          + share_name   = (known after apply)
          + type         = (known after apply)
        }
    }

  # azurerm_app_service_plan.app_service will be created
  + resource "azurerm_app_service_plan" "app_service" {
      + id                           = (known after apply)
      + kind                         = "Windows"
      + location                     = "eastus"
      + maximum_elastic_worker_count = (known after apply)
      + maximum_number_of_workers    = (known after apply)
      + name                         = (known after apply)
      + resource_group_name          = (known after apply)

      + sku {
          + capacity = 1
          + size     = "S1"
          + tier     = "Standard"
        }
    }

  # azurerm_resource_group.app_service will be created
  + resource "azurerm_resource_group" "app_service" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = (known after apply)
    }

  # random_integer.name_suffix will be created
  + resource "random_integer" "name_suffix" {
      + id     = (known after apply)
      + max    = 99999
      + min    = 10000
      + result = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

<details><summary>Show Checkov Results</summary>

### terraform scan results:

|    | check_id      | file                  | resource                             | check_name                                                                              | guideline                                                                                                         |
|----|---------------|-----------------------|--------------------------------------|-----------------------------------------------------------------------------------------|-------------------------------------------------------------------------------------------------------------------|
|  0 | CKV_AZURE_78  | /main/main.tf         | azurerm_app_service.app_service      | Ensure FTP deployments are disabled                                                     | https://docs.bridgecrew.io/docs/ensure-ftp-deployments-are-disabled                                               |
|  1 | CKV_AZURE_17  | /main/main.tf         | azurerm_app_service.app_service      | Ensure the web app has 'Client Certificates (Incoming client certificates)' set         | https://docs.bridgecrew.io/docs/bc_azr_networking_7                                                               |
|  2 | CKV_AZURE_63  | /main/main.tf         | azurerm_app_service.app_service      | Ensure that App service enables HTTP logging                                            | https://docs.bridgecrew.io/docs/ensure-that-app-service-enables-http-logging                                      |
|  3 | CKV_AZURE_18  | /main/main.tf         | azurerm_app_service.app_service      | Ensure that 'HTTP Version' is the latest if used to run the web app                     | https://docs.bridgecrew.io/docs/bc_azr_networking_8                                                               |
|  4 | CKV_AZURE_88  | /main/main.tf         | azurerm_app_service.app_service      | Ensure that app services use Azure Files                                                | https://docs.bridgecrew.io/docs/ensure-that-app-services-use-azure-files                                          |
|  5 | CKV_AZURE_16  | /main/main.tf         | azurerm_app_service.app_service      | Ensure that Register with Azure Active Directory is enabled on App Service              | https://docs.bridgecrew.io/docs/bc_azr_iam_1                                                                      |
|  6 | CKV_AZURE_71  | /main/main.tf         | azurerm_app_service.app_service      | Ensure that Managed identity provider is enabled for app services                       | https://docs.bridgecrew.io/docs/ensure-that-managed-identity-provider-is-enabled-for-app-services                 |
|  7 | CKV_AZURE_80  | /main/main.tf         | azurerm_app_service.app_service      | Ensure that 'Net Framework' version is the latest, if used as a part of the web app     | https://docs.bridgecrew.io/docs/ensure-that-net-framework-version-is-the-latest-if-used-as-a-part-of-the-web-app  |
|  8 | CKV_AZURE_65  | /main/main.tf         | azurerm_app_service.app_service      | Ensure that App service enables detailed error messages                                 | https://docs.bridgecrew.io/docs/tbdensure-that-app-service-enables-detailed-error-messages                        |
|  9 | CKV_AZURE_13  | /main/main.tf         | azurerm_app_service.app_service      | Ensure App Service Authentication is set on Azure App Service                           | https://docs.bridgecrew.io/docs/bc_azr_general_2                                                                  |
| 10 | CKV_AZURE_66  | /main/main.tf         | azurerm_app_service.app_service      | Ensure that App service enables failed request tracing                                  | https://docs.bridgecrew.io/docs/ensure-that-app-service-enables-failed-request-tracing                            |
| 11 | CKV_AZURE_33  | /remote_setup/main.tf | azurerm_storage_account.sa           | Ensure Storage logging is enabled for Queue service for read, write and delete requests | https://docs.bridgecrew.io/docs/enable-requests-on-storage-logging-for-queue-service                              |
| 12 | CKV_AZURE_35  | /remote_setup/main.tf | azurerm_storage_account.sa           | Ensure default network access rule for Storage Accounts is set to deny                  | https://docs.bridgecrew.io/docs/set-default-network-access-rule-for-storage-accounts-to-deny                      |
| 13 | CKV_AZURE_44  | /remote_setup/main.tf | azurerm_storage_account.sa           | Ensure Storage Account is using the latest version of TLS encryption                    | https://docs.bridgecrew.io/docs/bc_azr_storage_2                                                                  |
| 14 | CKV_GIT_4     | /remote_setup/main.tf | github_actions_secret.actions_secret | Ensure GitHub Actions secrets are encrypted                                             |                                                                                                                   |
| 15 | CKV2_AZURE_1  | /remote_setup/main.tf | azurerm_storage_account.sa           | Ensure storage for critical data are encrypted with Customer Managed Key                | https://docs.bridgecrew.io/docs/ensure-storage-for-critical-data-are-encrypted-with-customer-managed-key          |
| 16 | CKV2_AZURE_8  | /remote_setup/main.tf | azurerm_storage_account.sa           | Ensure the storage container storing the activity logs is not publicly accessible       | https://docs.bridgecrew.io/docs/ensure-the-storage-container-storing-the-activity-logs-is-not-publicly-accessible |
| 17 | CKV2_AZURE_18 | /remote_setup/main.tf | azurerm_storage_account.sa           | Ensure that Storage Accounts use customer-managed key for encryption                    | https://docs.bridgecrew.io/docs/ensure-that-storage-accounts-use-customer-managed-key-for-encryption              |
| 18 | CKV2_AZURE_21 | /remote_setup/main.tf | azurerm_storage_container.ct         | Ensure Storage logging is enabled for Blob service for read requests                    | https://docs.bridgecrew.io/docs/ensure-storage-logging-is-enabled-for-blob-service-for-read-requests              |

---

</details>

*Pusher: @gpehlev, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*